/*29.04.2025
Брикет Александр Сергеевич
1. Создать очередь для символов. Максимальный размер очереди вводится с экрана. 
Создать функции для ввода, вывода и определения размера очереди. Вводить символы с экрана в очередь. 
В случае совпадения вводимого символа с последним элементом очереди выводить размер очереди.
2. Создать дек для символов. Максимальный размер дека вводится с экрана. Создать функции
для ввода, вывода и определения размера дека. Добавлять символы в дек поочередно справа и слева. 
В случае совпадения добавляемого символа с элементом на другом конце дека выводить размер дека.
3. Используя очередь, проверьте на равенство два текстовых файла. Решение в программе
оформляйте через подпрограммы.
*/


#include <stdio.h>
#include <stdlib.h>
#include "functions.h"

int main() {
	chooseTask();
	return 0;
}